### [DataFrame의 인덱스 다루기 -2]
- 새로운 행 인덱스를 생성 및 적용
- 메서드 : 변수명.reindex(새로운 인덱스, fill_values)

In [1]:
# [1] 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],
       'kor':[89,100,99],
       'eng':[70,80,90],
       'math':[99,88,77]}

In [3]:
# [3] Dict => DataFrame 형태로 저장
jumsuDF=pd.DataFrame(jumsu)
jumsuDF

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [7]:
# [4] 행 인덱스를 새롭게 생성
new_index=[0,2,'r0','r1','r2']
DF2=jumsuDF.reindex(new_index)
DF2

    name   kor   eng  math
0    마징가  89.0  70.0  99.0
2   원더우먼  99.0  90.0  77.0
r0   NaN   NaN   NaN   NaN
r1   NaN   NaN   NaN   NaN
r2   NaN   NaN   NaN   NaN

In [9]:
new_index=[2,0,1,3]
DF2=jumsuDF.reindex(new_index)
DF2

   name    kor   eng  math
2  원더우먼   99.0  90.0  77.0
0   마징가   89.0  70.0  99.0
1   태권V  100.0  80.0  88.0
3   NaN    NaN   NaN   NaN

In [10]:
# [5] 행 인덱스를 새롭게 생성 => 존재하지 않는 행에 값 설정
DF3=jumsuDF.reindex([0,'r0','r1',2],fill_value=0)
DF3

    name  kor  eng  math
0    마징가   89   70    99
r0     0    0    0     0
r1     0    0    0     0
2   원더우먼   99   90    77